In [2]:
import numpy as np
import pandas as pd

In [ ]:
s1 = pd.Series([10, 20, 30, 40, 50])
s1

In [ ]:
type(s1)

In [ ]:
s1.index

In [ ]:
s1.values
print(type(s1.values), s1.values.dtype, s1.values.shape, s1.values)

In [ ]:
s2 = pd.Series(['a', 'b', 'c', 1, 2, 3])
s2.values.dtype

In [ ]:
s3 = pd.Series([np.nan, 20, 30]) # nan은 실수임
s3

In [ ]:
index_date = ['2022-10-14', '2022-10-15', '2022-10-16', '2022-10-17']
s4 = pd.Series([200, 195, np.nan, 205], index = index_date, name = '판매량')

s4

In [ ]:
print(s4.values)
print(s4.index)
print(s4.name)

In [ ]:
# dict를 이용한 Series 생성
dct = {'국어': 85, '영어': 94, '수학': 78, '과학': 88}
s5 = pd.Series(dct)
s5

In [ ]:
# 배열을 이용한 Series 생성
index_date = ['2022-10-14', '2022-10-15', '2022-10-16', '2022-10-17']
arr = np.array([200, 195, np.nan, 205])
s6 = pd.Series(arr, index = index_date, name = '판매량')

s6

In [ ]:
pd.date_range('2022-10-14', end='2022-10-21') # datetime64: 8바이트의 datetime 객체라는 뜻

In [ ]:
pd.date_range('2022/10/14', end='2022.10.21') # -가 기본 구분자

In [ ]:
pd.date_range('10/14/2022', end='10.21.2022') # YYYY-MM-DD가 기본 형식

In [ ]:
pd.date_range('2022/10/14', end='10.21.2022')

In [ ]:
pd.date_range('2022/10/14', periods=7)

In [ ]:
pd.date_range('2022-10-14', periods=4, freq='2D')

In [ ]:
pd.date_range('2022-10-14', periods=4, freq='W')

In [ ]:
pd.date_range('2022-10-14', periods=4, freq='W-FRI')

In [ ]:
pd.date_range('2022-10-14', periods=4, freq='2BM')

In [ ]:
pd.date_range('2022-10-14', periods=4, freq='QS')

In [ ]:
pd.date_range('2022-10-14', periods=4, freq='AS')

In [ ]:
pd.date_range('2022-10-14 00:00', periods=4, freq='H')

In [ ]:
pd.date_range('2022-10-14 08:00', periods=10, freq='BH')

In [ ]:
pd.date_range('2022-10-14 00:00', periods=4, freq='30min')

In [ ]:
pd.date_range('2022-10-14 00:00', periods=4, freq='30T') # 30분 단위

In [ ]:
pd.date_range('2022-10-14 00:00:00', periods=8, freq='10S') # 10초 단위

In [ ]:
index_date = pd.date_range('2022-10-14', periods=5, freq='D')
s = pd.Series([51, 62, 55, 49, 58], index=index_date)
s

In [ ]:
s.index

In [ ]:
s.index[0] # index 개별 사용 가능

In [3]:
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [4]:
s1 = pd.Series(['S01', 'S02', 'S03', 'S04'])
s2 = pd.Series(['박찬호', '손흥민', '류현진', '이승엽'])
s3 = pd.Series([85, 75, 90, 80])
s4 = pd.Series([75, 75, 85, 80])
s5 = pd.Series([90, 85, 80, 85])

In [6]:
df['학번'] = s1
df['이름'] = s2
df['국어'] = s3
df['영어'] = s4
df['수학'] = s5
df

    학번   이름  국어  영어  수학
0  S01  박찬호  85  75  90
1  S02  손흥민  75  75  85
2  S03  류현진  90  85  80
3  S04  이승엽  80  80  85

In [7]:
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [8]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [10]:
print(df.values.dtype, df.values.shape)
df.values # numpy 2차원 배열

int64 (3, 3)

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]], dtype=int64)

In [11]:
df.columns # index, values, columns 는 df의 속성

RangeIndex(start=0, stop=3, step=1)

In [12]:
arr = np.arange(10, 100, 10).reshape(3, 3)
df = pd.DataFrame(arr)
df

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

In [16]:
arr = np.arange(1, 13).reshape(4, 3)
index_date = pd.date_range('2022-10-14', periods=4)
column_names = ['col_A', 'col_B', 'col_C']

df = pd.DataFrame(arr, index=index_date, columns=column_names)
df

            col_A  col_B  col_C
2022-10-14      1      2      3
2022-10-15      4      5      6
2022-10-16      7      8      9
2022-10-17     10     11     12

In [17]:
print(df.index)
print(df.columns)
df.values

DatetimeIndex(['2022-10-14', '2022-10-15', '2022-10-16', '2022-10-17'], dtype='datetime64[ns]', freq='D')
Index(['col_A', 'col_B', 'col_C'], dtype='object')

array([[ 1,  2,  3],
       [ 4,  5,  6],
       [ 7,  8,  9],
       [10, 11, 12]])

In [18]:
dct = {'연도' : [2015, 2016, 2016, 2017, 2017], '지사':['한국', '한국', '미국', '한국', '미국'],
      '고객 수':[200, 250, 450, 300, 500]}
df = pd.DataFrame(dct)
df

     연도  지사  고객 수
0  2015  한국   200
1  2016  한국   250
2  2016  미국   450
3  2017  한국   300
4  2017  미국   500

In [19]:
dct = {'연도' : [2015, 2016, 2016, 2017, 2017], '지사':['한국', '한국', '미국', '한국', '미국'],
      '고객 수':[200, 250, 450, 300, 500]}
df = pd.DataFrame(dct, columns=['지사', '연도', '고객 수'])
df

   지사    연도  고객 수
0  한국  2015   200
1  한국  2016   250
2  미국  2016   450
3  한국  2017   300
4  미국  2017   500

In [20]:
dct = {'연도' : [2015, 2016, 2016, 2017, 2017], '지사':['한국', '한국', '미국', '한국', '미국'],
      '고객 수':[200, 250, 450, 300, 500]}
df = pd.DataFrame(dct, columns=['지사', '고객 수'])
df

   지사  고객 수
0  한국   200
1  한국   250
2  미국   450
3  한국   300
4  미국   500

In [23]:
dct = {'연도' : [2015, 2016, 2016, 2017, 2017], '지사':['한국', '한국', '미국', '한국', '미국'],
      '고객 수':[200, 250, 450, 300, 500]}
df = pd.DataFrame(dct, columns=['YEAR', '지사', '고객 수'])
df

# dict에서 column 이름 변경 불가
# dict에서 column 명은 순서를 결정하는 용도

  YEAR  지사  고객 수
0  NaN  한국   200
1  NaN  한국   250
2  NaN  미국   450
3  NaN  한국   300
4  NaN  미국   500

In [24]:
dct = {'연도' : [2015, 2016, 2016, 2017, 2017], '지사':['한국', '한국', '미국', '한국', '미국'],
      '고객 수':[200, 250, 450, 300, 500]}
df = pd.DataFrame(dct, columns=['지사', '연도', '고객 수'])

print(df.columns)
print(df.index)
df.values

Index(['지사', '연도', '고객 수'], dtype='object')
RangeIndex(start=0, stop=5, step=1)

array([['한국', 2015, 200],
       ['한국', 2016, 250],
       ['미국', 2016, 450],
       ['한국', 2017, 300],
       ['미국', 2017, 500]], dtype=object)

In [ ]:
'''
문제] 'data/stu_info.txt' 파일을 읽고 dict로 변환한 후 데이터프레임을 생성하는 코드를 작성하세요.
'''

In [36]:
# 방법 1. 순수 python code로 작성

with open('../data/stu_info.txt', 'rt') as f:
    lines = f.readlines()
    
keys = lines[0].split()
lines = lines[1:]
values = [[], [], [], [], []]

for line in lines:
    temp = line.split()
    values[0].append(temp[0])
    
    for i in range(1, len(temp)):
        values[i].append(int(temp[i])) # line 8 ~ 15를 numpy로 간단하게 처리 가능

stu_info = {}

for key, value in zip(keys, values):
    stu_info[key] = value
    
stu_info_df = pd.DataFrame(stu_info)
stu_info_df

    이름  국어  영어  수학  과학
0  손흥민  90  85  80  75
1  류현진  80  75  70  75
2  박찬호  85  70  75  80
3  이승엽  80  85  80  70
4  김연아  90  95  85  95

In [34]:
# zip : 파이썬 기본 내장함수, 2개 이상의 컨테이너를 하나로 묶을 때 사용
lst1 = [1, 2, 3, 4, 5]
lst2 = [10, 20, 30, 40, 50]

for num1, num2 in zip(lst1, lst2):
    print(num1, num2)

1 10
2 20
3 30
4 40
5 50

In [ ]:
# 방법 2. numpy 사용한 배열

In [40]:
s1 = pd.Series([10, 20, 30, 40, 50])
s2 = pd.Series([1, 2, 3, 4, 5])

print(s1 + s2)
print(s1 - s2)
print(s1 * s2)
print(s1 / s2)
print(s1 // s2)
print(s1 % s2)
print(s1 ** s2)

0    11
1    22
2    33
3    44
4    55
dtype: int64
0     9
1    18
2    27
3    36
4    45
dtype: int64
0     10
1     40
2     90
3    160
4    250
dtype: int64
0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
dtype: float64
0    10
1    10
2    10
3    10
4    10
dtype: int64
0    0
1    0
2    0
3    0
4    0
dtype: int64
0           10
1          400
2        27000
3      2560000
4    312500000
dtype: int64

In [41]:
s2 = pd.Series([1, 2, 3, 4, 5])

print(s2 + 2)
print(s1 - 2)
print(s1 * 2)
print(s1 / 2)
print(s1 // 2)
print(s1 % 2)
print(s1 ** 2)

0    3
1    4
2    5
3    6
4    7
dtype: int64
0     8
1    18
2    28
3    38
4    48
dtype: int64
0     20
1     40
2     60
3     80
4    100
dtype: int64
0     5.0
1    10.0
2    15.0
3    20.0
4    25.0
dtype: float64
0     5
1    10
2    15
3    20
4    25
dtype: int64
0    0
1    0
2    0
3    0
4    0
dtype: int64
0     100
1     400
2     900
3    1600
4    2500
dtype: int64

In [42]:
s2 = pd.Series([1, 2, 3, 4, 5])

print(s2 == 2)
print(s1 != 2)
print(s1 > 2)
print(s1 < 2)
print(s1 >= 2)
print(s1 <= 2)

0    False
1     True
2    False
3    False
4    False
dtype: bool
0    True
1    True
2    True
3    True
4    True
dtype: bool
0    True
1    True
2    True
3    True
4    True
dtype: bool
0    False
1    False
2    False
3    False
4    False
dtype: bool
0    True
1    True
2    True
3    True
4    True
dtype: bool
0    False
1    False
2    False
3    False
4    False
dtype: bool

In [43]:
s1 = pd.Series([False, True, False, True])
s2 = pd.Series([False, False, True, True])

print(s1 & s2)
print(s1 | s2)
print(~s1)

0    False
1    False
2    False
3     True
dtype: bool
0    False
1     True
2     True
3     True
dtype: bool
0     True
1    False
2     True
3    False
dtype: bool

In [44]:
arr1 = np.array([10, 20, 30, 40, 50])
arr2 = np.array([1, 2, 3, 4])

print(arr1 + arr2)

ValueError: operands could not be broadcast together with shapes (5,) (4,)

In [45]:
s1 = pd.Series([10, 20, 30, 40, 50])
s2 = pd.Series([1, 2, 3, 4])

print(s1 + s2) # 시리즈 대상 연산은 구조 달라도 연산 이루어짐, 단 연산 대상 없다면 결측치로 표현됨

0    11.0
1    22.0
2    33.0
3    44.0
4     NaN
dtype: float64

In [46]:
# 매우 중요
s1 = pd.Series([10, 20, 30, 40, 50], index=[1, 2, 3, 4, 5])
s2 = pd.Series([1, 2, 3, 4, 5], index=[3, 4, 5, 6, 7])

print(s1 + s2)
# 시리즈 사이 연산 수행 시에는 무조건 순서대로 아님, index가 같은 것만 연산 수행

1     NaN
2     NaN
3    31.0
4    42.0
5    53.0
6     NaN
7     NaN
dtype: float64

In [2]:
np.array(['문자열', 1234, 3.141592]) # 문자열 배열이 됨

array(['문자열', '1234', '3.141592'], dtype='<U32')

In [5]:
dct = {'연도' : [2015, 2016, 2016, 2017, 2017], '지사':['한국', '한국', '미국', '한국', '미국'],
      '고객 수':[200, 250, 450, 300, 500]}
df = pd.DataFrame(dct)
print(df.values.dtype)
print(type(df['연도']), df['연도'].values.dtype)
print(type(df['지사']), df['지사'].values.dtype)
print(type(df['고객 수']), df['고객 수'].values.dtype)

object
<class 'pandas.core.series.Series'> int64
<class 'pandas.core.series.Series'> object
<class 'pandas.core.series.Series'> int64

In [6]:
# 데이터프레임 간 연산 안 쓰는 이유

dct = {'연도' : [2015, 2016, 2016, 2017, 2017], '지사':['한국', '한국', '미국', '한국', '미국'],
      '고객 수':[200, 250, 450, 300, 500]}
df1 = pd.DataFrame(dct)

dct = {'연도' : [2015, 2016, 2016, 2017, 2017], '지사':['한국', '한국', '미국', '한국', '미국'],
      '고객 수':[200, 250, 450, 300, 500]}
df2 = pd.DataFrame(dct)

df1 + df2

     연도    지사  고객 수
0  4030  한국한국   400
1  4032  한국한국   500
2  4032  미국미국   900
3  4034  한국한국   600
4  4034  미국미국  1000

In [7]:
df1 / df2

TypeError: unsupported operand type(s) for /: 'str' and 'str'

In [8]:
dct = {'연도' : [2015, 2016, 2016, 2017, 2017], '지사':['한국', '한국', '미국', '한국', '미국'],
      '고객 수':[200, 250, 450, 300, 500]}
df1 = pd.DataFrame(dct)

dct = {'연도2' : [2015, 2016, 2016, 2017, 2017], '지사2':['한국', '한국', '미국', '한국', '미국'],
      '고객 수2':[200, 250, 450, 300, 500]}
df2 = pd.DataFrame(dct)

df1 + df2

   고객 수  고객 수2  연도  연도2   지사  지사2
0   NaN    NaN NaN  NaN  NaN  NaN
1   NaN    NaN NaN  NaN  NaN  NaN
2   NaN    NaN NaN  NaN  NaN  NaN
3   NaN    NaN NaN  NaN  NaN  NaN
4   NaN    NaN NaN  NaN  NaN  NaN

In [9]:
dct = {'연도' : [2015, 2016, 2016, 2017, 2017], '지사':['한국', '한국', '미국', '한국', '미국'],
      '고객 수':[200, 250, 450, 300, 500]}
df1 = pd.DataFrame(dct)

dct = {'연도' : [2015, 2016, 2016, 2017, 2017], '지사':['한국', '한국', '미국', '한국', '미국'],
      '고객 수':[200, 250, 450, 300, 500]}
df2 = pd.DataFrame(dct, index=[5, 6, 7, 8, 9])

df1 + df2

   연도   지사  고객 수
0 NaN  NaN   NaN
1 NaN  NaN   NaN
2 NaN  NaN   NaN
3 NaN  NaN   NaN
4 NaN  NaN   NaN
5 NaN  NaN   NaN
6 NaN  NaN   NaN
7 NaN  NaN   NaN
8 NaN  NaN   NaN
9 NaN  NaN   NaN

In [10]:
# 데이터프레임 간 연산은 특정 칼럼(series) 간의 연산으로 사용됨

dct = {'연도' : [2015, 2016, 2016, 2017, 2017], '지사':['한국', '한국', '미국', '한국', '미국'],
      '고객 수':[200, 250, 450, 300, 500]}
df1 = pd.DataFrame(dct)

dct = {'연도' : [2015, 2016, 2016, 2017, 2017], '지사':['한국', '한국', '미국', '한국', '미국'],
      '고객 수':[200, 250, 450, 300, 500]}
df2 = pd.DataFrame(dct)

df1['고객 수'] + df2['고객 수']

0     400
1     500
2     900
3     600
4    1000
Name: 고객 수, dtype: int64

In [11]:
dct = {'봄':[256.5, 264.3, 215.9, 223.2, 312.8], '여름':[770.6, 567.5, 599.8, 387.1, 446.2], 
       '가을':[363.5, 231.2, 393.1, 247.7, 381.6], '겨울':[139.3, 59.9, 76.9, 109.1, 108.1]}
df = pd.DataFrame(dct, index=[2012,2013,2014, 2015, 2016])
df

          봄     여름     가을     겨울
2012  256.5  770.6  363.5  139.3
2013  264.3  567.5  231.2   59.9
2014  215.9  599.8  393.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1

In [12]:
df.sum()

봄     1272.7
여름    2771.2
가을    1617.1
겨울     493.3
dtype: float64

In [13]:
df.mean()

봄     254.54
여름    554.24
가을    323.42
겨울     98.66
dtype: float64

In [14]:
df.std()

봄      38.628267
여름    148.888895
가을     77.596179
겨울     30.925523
dtype: float64

In [15]:
df.var()

봄      1492.143
여름    22167.903
가을     6021.167
겨울      956.388
dtype: float64

In [16]:
df.min()

봄     215.9
여름    387.1
가을    231.2
겨울     59.9
dtype: float64

In [17]:
df.max()

봄     312.8
여름    770.6
가을    393.1
겨울    139.3
dtype: float64

In [18]:
df.cumsum()

           봄      여름      가을     겨울
2012   256.5   770.6   363.5  139.3
2013   520.8  1338.1   594.7  199.2
2014   736.7  1937.9   987.8  276.1
2015   959.9  2325.0  1235.5  385.2
2016  1272.7  2771.2  1617.1  493.3

In [19]:
df.cumprod() # 되긴 하지만 의미는 없음

                 봄            여름            가을            겨울
2012  2.565000e+02  7.706000e+02  3.635000e+02  1.393000e+02
2013  6.779295e+04  4.373155e+05  8.404120e+04  8.344070e+03
2014  1.463650e+07  2.623018e+08  3.303660e+07  6.416590e+05
2015  3.266866e+09  1.015370e+11  8.183165e+09  7.000500e+07
2016  1.021876e+12  4.530583e+13  3.122696e+12  7.567540e+09

In [20]:
df.sum()

봄     1272.7
여름    2771.2
가을    1617.1
겨울     493.3
dtype: float64

In [21]:
df.sum(axis=0)

봄     1272.7
여름    2771.2
가을    1617.1
겨울     493.3
dtype: float64

In [22]:
df.sum(axis=1)

2012    1529.9
2013    1122.9
2014    1285.7
2015     967.1
2016    1248.7
dtype: float64

In [23]:
df.mean(axis=1)

2012    382.475
2013    280.725
2014    321.425
2015    241.775
2016    312.175
dtype: float64

In [24]:
df.std(axis=1)

2012    274.472128
2013    211.128782
2014    226.243193
2015    114.166760
2016    146.548658
dtype: float64

In [25]:
df.cumsum(axis=1)

          봄      여름      가을      겨울
2012  256.5  1027.1  1390.6  1529.9
2013  264.3   831.8  1063.0  1122.9
2014  215.9   815.7  1208.8  1285.7
2015  223.2   610.3   858.0   967.1
2016  312.8   759.0  1140.6  1248.7

In [27]:
print(df['봄'].sum(), df['봄'].mean())

1272.6999999999998 254.53999999999996

In [28]:
print(df['봄'].var(), df['봄'].std())

1492.1430000000005 38.62826685213822

In [29]:
print(df['봄'].min(), df['봄'].max())

215.9 312.8

In [30]:
df['봄'].cumsum()

2012     256.5
2013     520.8
2014     736.7
2015     959.9
2016    1272.7
Name: 봄, dtype: float64

In [31]:
df['봄'].cumprod()

2012    2.565000e+02
2013    6.779295e+04
2014    1.463650e+07
2015    3.266866e+09
2016    1.021876e+12
Name: 봄, dtype: float64

In [32]:
df.describe()

                봄          여름          가을          겨울
count    5.000000    5.000000    5.000000    5.000000
mean   254.540000  554.240000  323.420000   98.660000
std     38.628267  148.888895   77.596179   30.925523
min    215.900000  387.100000  231.200000   59.900000
25%    223.200000  446.200000  247.700000   76.900000
50%    256.500000  567.500000  363.500000  108.100000
75%    264.300000  599.800000  381.600000  109.100000
max    312.800000  770.600000  393.100000  139.300000

In [39]:
KTX_df = pd.DataFrame({'경부선 KTX':[39060, 39896, 42005, 43621, 41702, 41266, 32427],
           '호남선 KTX': [7313, 6967, 6873, 6626, 8675, 10622, 9228],
           '경전선 KTX': [3627, 4168, 4088, 4424, 4606, 4984, 5570],
           '전라선 KTX': [309, 1771, 1954, 2244, 3146, 3945, 5766],
           '동해선 KTX': [np.nan, np.nan, np.nan, np.nan, 2395, 3786, 6667]},
            index = ['2011', '2012', '2013', '2014', '2015', '2016', '2017'])
KTX_df.index.name = '년도' # index에 이름 지정 가능
KTX_df

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
년도
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [40]:
KTX_df.index

Index(['2011', '2012', '2013', '2014', '2015', '2016', '2017'], dtype='object', name='년도')

In [41]:
KTX_df.columns

Index(['경부선 KTX', '호남선 KTX', '경전선 KTX', '전라선 KTX', '동해선 KTX'], dtype='object')

In [45]:
print(KTX_df.values.dtype)
KTX_df.values # NaN 때문에 전체 float 되기 때문에 잘 사용하지 않음

float64

array([[39060.,  7313.,  3627.,   309.,    nan],
       [39896.,  6967.,  4168.,  1771.,    nan],
       [42005.,  6873.,  4088.,  1954.,    nan],
       [43621.,  6626.,  4424.,  2244.,    nan],
       [41702.,  8675.,  4606.,  3146.,  2395.],
       [41266., 10622.,  4984.,  3945.,  3786.],
       [32427.,  9228.,  5570.,  5766.,  6667.]])

In [46]:
KTX_df.head() # 기본 개수: 5개

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
년도
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0

In [47]:
KTX_df.head(3)

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
년도
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN

In [48]:
KTX_df.tail()

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
년도
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [49]:
KTX_df.tail(3)

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
년도
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [ ]:
'''
index_pos: 순서번호 인덱스
index_name: 사용자 인덱스
'''

In [50]:
KTX_df[1:2]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
년도
2012    39896     6967     4168     1771      NaN

In [51]:
KTX_df[2:5]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
년도
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0

In [52]:
KTX_df[1:2]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
년도
2012    39896     6967     4168     1771      NaN

In [53]:
# KTX_df[1]은 오류, 단일 순서번호 인덱스는 불가능
KTX_df[1]

KeyError: 1

In [54]:
KTX_df[::2] # step 지정 가능

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
년도
2011    39060     7313     3627      309      NaN
2013    42005     6873     4088     1954      NaN
2015    41702     8675     4606     3146   2395.0
2017    32427     9228     5570     5766   6667.0

In [55]:
KTX_df[-1:-5:-1] # 역방향 인덱스 사용 가능

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
년도
2017    32427     9228     5570     5766   6667.0
2016    41266    10622     4984     3945   3786.0
2015    41702     8675     4606     3146   2395.0
2014    43621     6626     4424     2244      NaN

In [56]:
KTX_df.loc['2012'] # index name으로 행 범위 지정할 때, series임

경부선 KTX    39896.0
호남선 KTX     6967.0
경전선 KTX     4168.0
전라선 KTX     1771.0
동해선 KTX        NaN
Name: 2012, dtype: float64

In [57]:
KTX_df.loc['2012':'2016'] # 끝 범위 포함

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
년도
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0

In [58]:
KTX_df.loc[::2]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
년도
2011    39060     7313     3627      309      NaN
2013    42005     6873     4088     1954      NaN
2015    41702     8675     4606     3146   2395.0
2017    32427     9228     5570     5766   6667.0

In [60]:
KTX_df.loc['2016'::-2] # 역방향 슬라이싱 가능

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
년도
2016    41266    10622     4984     3945   3786.0
2014    43621     6626     4424     2244      NaN
2012    39896     6967     4168     1771      NaN

In [61]:
KTX_df['호남선 KTX'] # 단일 행/열의 결과는 series임

년도
2011     7313
2012     6967
2013     6873
2014     6626
2015     8675
2016    10622
2017     9228
Name: 호남선 KTX, dtype: int64

In [62]:
KTX_df[['호남선 KTX', '경부선 KTX', '전라선 KTX']] # 리스팅의 결과는 데이터프레임

      호남선 KTX  경부선 KTX  전라선 KTX
년도
2011     7313    39060      309
2012     6967    39896     1771
2013     6873    42005     1954
2014     6626    43621     2244
2015     8675    41702     3146
2016    10622    41266     3945
2017     9228    32427     5766

In [65]:
KTX_df[['호남선 KTX']] # 단일 열인데 데이터프레임으로 보고 싶으면 대괄호 두 번

      호남선 KTX
년도
2011     7313
2012     6967
2013     6873
2014     6626
2015     8675
2016    10622
2017     9228

In [70]:
KTX_df['경부선 KTX']['2012':'2014'] # 인덱스 슬라이싱

년도
2012    39896
2013    42005
2014    43621
Name: 경부선 KTX, dtype: int64

In [69]:
KTX_df['경부선 KTX'][1:4]

년도
2012    39896
2013    42005
2014    43621
Name: 경부선 KTX, dtype: int64

In [ ]:
'''
문제] 2016년도 호남선 KTX 고객의 수를 조회하는 코드를 작성하세요.
'''

In [71]:
KTX_df.loc['2016']['호남선 KTX']

10622.0

In [72]:
KTX_df.loc['2016', '호남선 KTX']

10622

In [73]:
KTX_df['호남선 KTX']['2016']

10622

In [74]:
KTX_df['호남선 KTX'][5]

10622

In [75]:
KTX_df['호남선 KTX'].loc['2016']

10622

In [76]:
KTX_df.loc['2016'] # 단일 행, float64(NaN 때문에 2016년 동해선이 실수이기 때문)

경부선 KTX    41266.0
호남선 KTX    10622.0
경전선 KTX     4984.0
전라선 KTX     3945.0
동해선 KTX     3786.0
Name: 2016, dtype: float64

In [77]:
KTX_df

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
년도
2011    39060     7313     3627      309      NaN
2012    39896     6967     4168     1771      NaN
2013    42005     6873     4088     1954      NaN
2014    43621     6626     4424     2244      NaN
2015    41702     8675     4606     3146   2395.0
2016    41266    10622     4984     3945   3786.0
2017    32427     9228     5570     5766   6667.0

In [ ]:
'''
문제1] 2012, 2014, 2015년도의 호남선, 전라선, 경부선 KTX 고객 수를 조회하는 코드를 작성하세요.
        단, 앞에서의 5가지 방법을 모두 사용하여 가능한 방법과 불가능한 방법을 구별하여 나타내세요.
        
    1. KTX_df.loc[['2012', '2014', '2015']][['호남선 KTX', '전라선 KTX', '경부선 KTX']] ==> OK
    2. KTX_df.loc[['2012', '2014', '2015'], ['호남선 KTX', '전라선 KTX', '경부선 KTX']] ==> OK
    3. KTX_df[['호남선 KTX', '전라선 KTX', '경부선 KTX']][['2012', '2014', '2015']]     ==> Error
    4. KTX_df[['호남선 KTX', '전라선 KTX', '경부선 KTX']][[1, 3, 4]]                    ==> Error
    5. KTX_df[['호남선 KTX', '전라선 KTX', '경부선 KTX']].loc[['2012', '2014', '2015']] ==> OK
'''

In [79]:
KTX_df.loc[['2012', '2014', '2015']][['호남선 KTX', '전라선 KTX', '경부선 KTX']]

      호남선 KTX  전라선 KTX  경부선 KTX
년도
2012     6967     1771    39896
2014     6626     2244    43621
2015     8675     3146    41702

In [80]:
KTX_df.loc[['2012', '2014', '2015'], ['호남선 KTX', '전라선 KTX', '경부선 KTX']]

      호남선 KTX  전라선 KTX  경부선 KTX
년도
2012     6967     1771    39896
2014     6626     2244    43621
2015     8675     3146    41702

In [81]:
# 에러
KTX_df[['호남선 KTX', '전라선 KTX', '경부선 KTX']][['2012', '2014', '2015']]

KeyError: "None of [Index(['2012', '2014', '2015'], dtype='object')] are in the [columns]"

In [82]:
# 에러
KTX_df[['호남선 KTX', '전라선 KTX', '경부선 KTX']][[1, 3, 4]]

KeyError: "None of [Int64Index([1, 3, 4], dtype='int64')] are in the [columns]"

In [83]:
KTX_df[['호남선 KTX', '전라선 KTX', '경부선 KTX']].loc[['2012', '2014', '2015']]

      호남선 KTX  전라선 KTX  경부선 KTX
년도
2012     6967     1771    39896
2014     6626     2244    43621
2015     8675     3146    41702

In [ ]:
'''
문제2] 2013년도부터 2015년도까지, 호남선부터 전라선까지의 KTX 고객 수를 조회하는 코드를 작성하세요.
        단, 앞에서의 5가지 방법을 모두 사용하여 가능한 방법과 불가능한 방법을 구별하여 나타내세요.

        1. KTX_df.loc['2013':'2015']['호남선 KTX':'전라선 KTX'] ==> Fail
        2. KTX_df.loc['2013':'2015', '호남선 KTX':'전라선 KTX'] ==> OK
        3. KTX_df['호남선 KTX':'전라선 KTX']['2013':'2015']     ==> Fail
        4. KTX_df['호남선 KTX':'전라선 KTX'][2:5]               ==> Fail
        5. KTX_df['호남선 KTX':'전라선 KTX'].loc['2013':'2015'] ==> Fail
'''

In [84]:
# 오류는 아니지만 Fail
KTX_df.loc['2013':'2015']['호남선 KTX':'전라선 KTX']

Empty DataFrame
Columns: [경부선 KTX, 호남선 KTX, 경전선 KTX, 전라선 KTX, 동해선 KTX]
Index: []

In [85]:
KTX_df.loc['2013':'2015', '호남선 KTX':'전라선 KTX']

      호남선 KTX  경전선 KTX  전라선 KTX
년도
2013     6873     4088     1954
2014     6626     4424     2244
2015     8675     4606     3146

In [86]:
KTX_df['호남선 KTX':'전라선 KTX']['2013':'2015']

Empty DataFrame
Columns: [경부선 KTX, 호남선 KTX, 경전선 KTX, 전라선 KTX, 동해선 KTX]
Index: []

In [87]:
KTX_df['호남선 KTX':'전라선 KTX'][2:5]

Empty DataFrame
Columns: [경부선 KTX, 호남선 KTX, 경전선 KTX, 전라선 KTX, 동해선 KTX]
Index: []

In [88]:
KTX_df['호남선 KTX':'전라선 KTX'].loc['2013':'2015']

Empty DataFrame
Columns: [경부선 KTX, 호남선 KTX, 경전선 KTX, 전라선 KTX, 동해선 KTX]
Index: []

In [ ]:
'''
문제3] 2014, 2014, 2015년도의 호남선부터 전라선까지의 KTX 고객 수를 조회하는 코드를 작성하세요.
        단, 앞에서의 5가지 방법을 모두 사용하여 가능한 방법과 불가능한 방법을 구별하여 나타내세요.
'''

In [89]:
KTX_df.loc[['2012', '2014', '2015'], '호남선 KTX':'전라선 KTX']

      호남선 KTX  경전선 KTX  전라선 KTX
년도
2012     6967     4168     1771
2014     6626     4424     2244
2015     8675     4606     3146

In [ ]:
'''
문제4] 2013년도부터 2015년도까지 호남선, 전라선, 경부선 KTX 고객 수를 조회하는 코드를 작성하세요.
        단, 앞에서의 5가지 방법을 모두 사용하여 가능한 방법과 불가능한 방법을 구별하여 나타내세요.     
'''

In [90]:
KTX_df.loc['2013':'2015', ['호남선 KTX', '전라선 KTX', '경부선 KTX']]

      호남선 KTX  전라선 KTX  경부선 KTX
년도
2013     6873     1954    42005
2014     6626     2244    43621
2015     8675     3146    41702

In [92]:
# 전치, Transpose
KTX_df.T # 모든 열에 있는 NaN 때문에 전체가 다 실수 데이터로 바뀜

년도          2011     2012     2013     2014     2015     2016     2017
경부선 KTX  39060.0  39896.0  42005.0  43621.0  41702.0  41266.0  32427.0
호남선 KTX   7313.0   6967.0   6873.0   6626.0   8675.0  10622.0   9228.0
경전선 KTX   3627.0   4168.0   4088.0   4424.0   4606.0   4984.0   5570.0
전라선 KTX    309.0   1771.0   1954.0   2244.0   3146.0   3945.0   5766.0
동해선 KTX      NaN      NaN      NaN      NaN   2395.0   3786.0   6667.0

In [93]:
# column name listing - 대괄호 2개
KTX_df[['호남선 KTX', '전라선 KTX', '경부선 KTX']]

      호남선 KTX  전라선 KTX  경부선 KTX
년도
2011     7313      309    39060
2012     6967     1771    39896
2013     6873     1954    42005
2014     6626     2244    43621
2015     8675     3146    41702
2016    10622     3945    41266
2017     9228     5766    32427

In [ ]:
'''
문제] 'data/coffee_shop_sales.txt' 파일을 읽고 다음의 결과를 출력하는 코드를 작성하세요.
        단, pandas를 사용하여 문제를 해결합니다.

[출력 결과]

에스프레소 [10, 12, 11, 15] / 총 판매량: 48, 평균 판매량: 12.0
아메리카노 [xx, xx, xx, xx] / 총 판매량: xx, 평균 판매량: xx.x
카페라떼 [xx, xx, xx, xx] / 총 판매량: xx, 평균 판매량: xx.x
카푸치노 [xx, xx, xx, xx] / 총 판매량: xx, 평균 판매량: xx.x
'''

In [104]:
# answer

with open('../data/coffee_shop_sales.txt', 'rt') as f:
    lines = f.readlines()

index_name = lines[0].split()[0]
coffee_menu = lines[0].split()[1:]

lines = lines[1:]
index_date = []

for i in range(len(lines)):
    temp = lines[i].split()
    index_date.append(temp[0])
    lines[i] = temp[1:]

coffee_menu_sales = np.array(lines).astype(np.int32).transpose()
coffee_menu_sales_dct = {}

for i in range(len(coffee_menu)):
    coffee_menu_sales_dct[coffee_menu[i]] = coffee_menu_sales[i]
    
coffee_sales_df = pd.DataFrame(coffee_menu_sales_dct, index=index_date)
coffee_sales_df.index.name = index_name

for column_name in coffee_sales_df.columns:
    print('%s %s / 총 판매량: %d, 평균 판매량: %.1f' % (column_name,
        coffee_sales_df[column_name].values,
        coffee_sales_df[column_name].sum(), coffee_sales_df[column_name].mean()))

에스프레소 [10 12 11 15] / 총 판매량: 48, 평균 판매량: 12.0
아메리카노 [50 45 53 49] / 총 판매량: 197, 평균 판매량: 49.2
카페라떼 [45 41 32 38] / 총 판매량: 156, 평균 판매량: 39.0
카푸치노 [20 18 25 22] / 총 판매량: 85, 평균 판매량: 21.2

In [137]:
# again

with open('../data/coffee_shop_sales.txt', 'rt') as f:
    lines = f.readlines()
    
header = lines[0].split()
index_name = header[0]
header = header[1:]

lines = lines[1:]
index_date = []

for i in range(len(lines)):
    temp = lines[i].split()
    index_date.append(temp[0])
    lines[i] = temp[1:]

coffee_sales_arr = np.array(lines).astype(np.int32).transpose()
coffee_sales_dct = {}

for i in range(len(header)):
    coffee_sales_dct[header[i]] = coffee_sales_arr[i]
    
coffee_sales_df = pd.DataFrame(coffee_sales_dct, index=index_date)
coffee_sales_df.index.name = index_name

for column_name in coffee_sales_df.columns:
    print('%s %s / 총 판매량: %d, 평균 판매량: %.1f' % (column_name,
        coffee_sales_df[column_name].values, coffee_sales_df[column_name].sum(), coffee_sales_df[column_name].mean()))

에스프레소 [10 12 11 15] / 총 판매량: 48, 평균 판매량: 12.0
아메리카노 [50 45 53 49] / 총 판매량: 197, 평균 판매량: 49.2
카페라떼 [45 41 32 38] / 총 판매량: 156, 평균 판매량: 39.0
카푸치노 [20 18 25 22] / 총 판매량: 85, 평균 판매량: 21.2

In [6]:
df1 = pd.DataFrame({'class1':[82,90,95,85], 'class2':[95,83,87,100]})
df2 = pd.DataFrame({'class1':[75,88], 'class2':[90,87]})

In [7]:
df1.append(df2)
# 인덱스 유지, 중복 됨

C:\Users\Home\AppData\Local\Temp\ipykernel_18316\3062608662.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2)

   class1  class2
0      82      95
1      90      83
2      95      87
3      85     100
0      75      90
1      88      87

In [8]:
df1.append(df2, ignore_index=True)
# 인덱스 문제 해결

C:\Users\Home\AppData\Local\Temp\ipykernel_18316\2149412069.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2, ignore_index=True)

   class1  class2
0      82      95
1      90      83
2      95      87
3      85     100
4      75      90
5      88      87

In [9]:
# df.append는 데이터프레임의 메서드, concat은 함수
pd.concat([df1, df2])

   class1  class2
0      82      95
1      90      83
2      95      87
3      85     100
0      75      90
1      88      87

In [10]:
pd.concat([df1, df2], ignore_index=True)

   class1  class2
0      82      95
1      90      83
2      95      87
3      85     100
4      75      90
5      88      87

In [12]:
df3 = pd.DataFrame({'class1':[85, 78]})
df2.append(df3, ignore_index=True)

C:\Users\Home\AppData\Local\Temp\ipykernel_18316\3889598938.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df2.append(df3, ignore_index=True)

   class1  class2
0      75    90.0
1      88    87.0
2      85     NaN
3      78     NaN

In [14]:
pd.concat([df2, df3], ignore_index=True)

   class1  class2
0      75    90.0
1      88    87.0
2      85     NaN
3      78     NaN

In [15]:
# 칼럼 추가일 뿐 세로 방향 통합은 아님
df4 = pd.DataFrame({'class3':[66,77], 'class4':[88,99]})
df2.append(df4, ignore_index=True)

C:\Users\Home\AppData\Local\Temp\ipykernel_18316\3370152965.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df2.append(df4, ignore_index=True)

   class1  class2  class3  class4
0    75.0    90.0     NaN     NaN
1    88.0    87.0     NaN     NaN
2     NaN     NaN    66.0    88.0
3     NaN     NaN    77.0    99.0

In [16]:
pd.concat([df2, df4], ignore_index=True)
# 칼럼 명이 같아야 수직 방향으로 연결이 됨
# 원래 df는 수정되지 않음

   class1  class2  class3  class4
0    75.0    90.0     NaN     NaN
1    88.0    87.0     NaN     NaN
2     NaN     NaN    66.0    88.0
3     NaN     NaN    77.0    99.0

In [23]:
# 가로 방향 통합 1) join
df4 = pd.DataFrame({'class3':[66,77, 88,99]})
df1.join(df4)

   class1  class2  class3
0      82      95      66
1      90      83      77
2      95      87      88
3      85     100      99

In [26]:
index_label = ['a', 'b', 'c', 'd']
df1_a = pd.DataFrame({'class1':[82,90,95,85], 'class2':[95,83,87,100]}, index=index_label)
df4_a = pd.DataFrame({'class3':[66,77,88,99]}, index=index_label)
df1_a.join(df4_a)

   class1  class2  class3
a      82      95      66
b      90      83      77
c      95      87      88
d      85     100      99

In [28]:
df5 = pd.DataFrame({'class4':[67,78]})
df1.join(df5)

   class1  class2  class4
0      82      95    67.0
1      90      83    78.0
2      95      87     NaN
3      85     100     NaN

In [32]:
df1.join(df3) # 컬럼 명 중복 시 오류

ValueError: columns overlap but no suffix specified: Index(['class1'], dtype='object')

In [33]:
df4_b = pd.DataFrame({'class3':[66,77,88,99]}, index=[2, 3, 4, 5])
df1.join(df4_b) # 앞 데이터프레임의 인덱스가 기준이 됨

   class1  class2  class3
0      82      95     NaN
1      90      83     NaN
2      95      87    66.0
3      85     100    77.0

In [34]:
df4_b.join(df1)

   class3  class1  class2
2      66    95.0    87.0
3      77    85.0   100.0
4      88     NaN     NaN
5      99     NaN     NaN

In [36]:
# 가로 방향 통합 2) merge


df_A_B = pd.DataFrame({'판매월':['1월', '2월', '3월', '4월'],
                       '제품A':[100, 110, 120, 130], '제품B':[200, 210, 220, 230]})
df_C_D = pd.DataFrame({'판매월':['1월', '2월', '3월', '4월'],
                       '제품C':[300, 310, 320, 330], '제품D':[400, 410, 420, 430]})

In [39]:
df_A_B.merge(df_C_D)

  판매월  제품A  제품B  제품C  제품D
0  1월  100  200  300  400
1  2월  110  210  310  410
2  3월  120  220  320  420
3  4월  130  230  330  430

In [40]:
df_A_B = pd.DataFrame({'판매월':['1월', '2월', '3월', '4월'],
                       '제품A':[100, 110, 120, 130], '제품B':[200, 210, 220, 230]})
df_C_D = pd.DataFrame({'판매월':['4월', '3월', '2월', '1월'],
                       '제품C':[300, 310, 320, 330], '제품D':[400, 410, 420, 430]})

In [41]:
df_A_B.merge(df_C_D) # 순서 상관 없이 같은 것끼리 묶임

  판매월  제품A  제품B  제품C  제품D
0  1월  100  200  330  430
1  2월  110  210  320  420
2  3월  120  220  310  410
3  4월  130  230  300  400

In [42]:
df_C_D_2 = pd.DataFrame({'판매월':['3월', '4월', '5월', '6월'],
                       '제품C':[300, 310, 320, 330], '제품D':[400, 410, 420, 430]})

In [43]:
df_A_B.merge(df_C_D_2) # 3, 4월만 겹침. 공통 값이 일치하는 것만 나옴

  판매월  제품A  제품B  제품C  제품D
0  3월  120  220  300  400
1  4월  130  230  310  410

In [44]:
df_A_B.merge(df_C_D_2, how='inner')

  판매월  제품A  제품B  제품C  제품D
0  3월  120  220  300  400
1  4월  130  230  310  410

In [45]:
df_A_B.merge(df_C_D_2, how='left')

  판매월  제품A  제품B    제품C    제품D
0  1월  100  200    NaN    NaN
1  2월  110  210    NaN    NaN
2  3월  120  220  300.0  400.0
3  4월  130  230  310.0  410.0

In [46]:
df_A_B.merge(df_C_D_2, how='right')

  판매월    제품A    제품B  제품C  제품D
0  3월  120.0  220.0  300  400
1  4월  130.0  230.0  310  410
2  5월    NaN    NaN  320  420
3  6월    NaN    NaN  330  430

In [47]:
df_A_B.merge(df_C_D_2, how='outer')

  판매월    제품A    제품B    제품C    제품D
0  1월  100.0  200.0    NaN    NaN
1  2월  110.0  210.0    NaN    NaN
2  3월  120.0  220.0  300.0  400.0
3  4월  130.0  230.0  310.0  410.0
4  5월    NaN    NaN  320.0  420.0
5  6월    NaN    NaN  330.0  430.0

In [ ]:
# 데이터 파일을 읽고 쓰기

In [51]:
%%writefile ../data/sea_temp1.csv # 기본이 UTF-8
연도, 동해, 남해, 서해, 전체
1996,17.4629, 17.2288, 14.436, 15.9067
1997,17.4116, 17.5092, 14.8248, 16.1526
1998,17.5944,18.011,15.2512,16.6044
1999,18.1495,18.3175,14.8979,16.6284
2000,17.9288,18.1766,15.0504,16.6178

Writing ../data/sea_temp1.csv

In [52]:
df = pd.read_csv('../data/sea_temp1.csv')
df

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.5092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [53]:
# read_csv는 UTF-8만 읽기 때문에 오류 발생
df = pd.read_csv('../data/sea_temp1_from_notepad.csv')
df

UnicodeDecodeError: 'utf-8' codec can't decode byte 0xbf in position 0: invalid start byte

In [54]:
# encoding 방식 지정
df = pd.read_csv('../data/sea_temp1_from_notepad.csv', encoding='CP949')
df

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.5092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [65]:
%%writefile ../data/sea_temp1_space.txt
연도 동해 남해 서해 전체
1996 17.4629 17.2288 14.436 15.9067
1997 17.4116 17.5092 14.8248 16.1526
1998 17.5944 18.011 15.2512 16.6044
1999 18.1495 18.3175 14.8979 16.6284
2000 17.9288 18.1766 15.0504 16.6178

Writing ../data/sea_temp1_space.txt

In [66]:
df = pd.read_csv('../data/sea_temp1_space.txt')
df

                         연도 동해 남해 서해 전체
0   1996 17.4629 17.2288 14.436 15.9067
1  1997 17.4116 17.5092 14.8248 16.1526
2   1998 17.5944 18.011 15.2512 16.6044
3  1999 18.1495 18.3175 14.8979 16.6284
4  2000 17.9288 18.1766 15.0504 16.6178

In [67]:
df = pd.read_csv('../data/sea_temp1_space.txt',sep=' ')
df

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.5092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [68]:
df = pd.read_csv('../data/sea_temp1_space.txt',sep=' ', index_col='연도')
df

           동해       남해       서해       전체
연도
1996  17.4629  17.2288  14.4360  15.9067
1997  17.4116  17.5092  14.8248  16.1526
1998  17.5944  18.0110  15.2512  16.6044
1999  18.1495  18.3175  14.8979  16.6284
2000  17.9288  18.1766  15.0504  16.6178

In [70]:
df_WH = pd.DataFrame({'Weight':[62,67,55,72], 'Height':[165,177,160,180]},
                    index=['ID_1', 'ID_2', 'ID_3', 'ID_4'])

df_WH.index.name = 'User'
df_WH

      Weight  Height
User
ID_1      62     165
ID_2      67     177
ID_3      55     160
ID_4      72     180

In [73]:
bmi = df_WH['Weight'] / (df_WH['Height'] / 100)**2
bmi

User
ID_1    22.773186
ID_2    21.385936
ID_3    21.484375
ID_4    22.222222
dtype: float64

In [74]:
df_WH['BMI'] = bmi
df_WH

      Weight  Height        BMI
User
ID_1      62     165  22.773186
ID_2      67     177  21.385936
ID_3      55     160  21.484375
ID_4      72     180  22.222222

In [75]:
df_WH.to_csv('../data/save_DataFrame.csv') # csv 구분자는 콤마

In [78]:
df = pd.read_csv('../data/save_DataFrame.csv', index_col='User')
df

      Weight  Height        BMI
User
ID_1      62     165  22.773186
ID_2      67     177  21.385936
ID_3      55     160  21.484375
ID_4      72     180  22.222222

In [79]:
df_pr = pd.DataFrame({'판매가격':[2000,3000,5000,10000], '판매량':[32,53,40,25]},
                    index=['P1001','P1002','P1003','P1004'])
df_pr.index.name = '제품번호'
df_pr

        판매가격  판매량
제품번호
P1001   2000   32
P1002   3000   53
P1003   5000   40
P1004  10000   25

In [80]:
df_pr.to_csv('../data/save_DataFrame_cp949.txt', sep=' ',encoding='CP949')

In [81]:
df = pd.read_csv('../data/save_DataFrame_cp949.txt', sep=' ',encoding='CP949',
                index_col = '제품번호')
df

        판매가격  판매량
제품번호
P1001   2000   32
P1002   3000   53
P1003   5000   40
P1004  10000   25

In [ ]:
'''
문제] 'data/coffee_shop_sales.txt' 파일을 read_csv 함수를 사용해 읽고 데이터프레임으로 변환하는 코드를 작성하세요.
        단, 날짜는 인덱스로 사용합니다.
        
[coffee_shop_sales.txt / CP949]
날짜   에스프레소    아메리카노  카페라떼   카푸치노
10.15          10            50        45         20
10.16          12            45        41         18
10.17          11            53        32         25
10.18          15            49        38         22
'''

ValueError: Invalid file path or buffer object type: <class 'list'>